tt='''士兵		先决条件	---	生命值	30
剑	重甲	护手	重型鞋类	药水	盾
锤	---	---	---	---	---
匕首	---	---	---	---	---
---	---	---	---	---	---
					
雇佣兵（士兵等级提升）		先决条件	泰坦之魂	生命值	60
剑	重甲	护手	重型鞋类	药水	盾
锤	---	---	---	---	---
匕首	---	---	---	---	---
矛	---	---	---	---	---
					
野蛮人		先决条件	商人LV. 10	生命值	35
剑	头盔	护手	重型鞋类	药水	草药
斧头	---	---	---	---	披风
矛	---	---	---	---	---
锤	---	---	---	---	---
					
头目（野蛮人阶级晋升）		先决条件	泰坦之魂	生命值	70
剑	头盔	护手	重型鞋类	药水	草药
斧头	---	---	---	---	盾
矛	---	---	---	---	披风
锤	---	---	---	---	---
					
骑士		先决条件	商人LV. 22	生命值	42
矛	重甲	护手	头盔	重型鞋类	盾
斧头	---	---	---	---	---
---	---	---	---	---	---
---	---	---	---	---	---
					
主（骑士等级提升）		先决条件	泰坦之魂	生命值	84
矛	重甲	护手	头盔	重型鞋类	盾
斧头	---	---	---	---	---
剑	---	---	---	---	---
锤	---	---	---	---	---
					
游侠		先决条件	商人LV. 32	生命值	33
弓	重甲	护手	头盔	药水	戒指
弩	---	---	---	---	披风
枪	---	---	---	---	---
---	---	---	---	---	---
					
典狱长（游侠级促销）		先决条件	泰坦之魂	生命值	66
弓	重甲	护手	头盔	药水	戒指
弩	---	---	---	---	披风
枪	---	---	---	---	---
---	---	---	---	---	---
					
武士		先决条件	商人LV. 46	生命值	40
剑	重甲	护手	头盔	重型鞋类	药水
弓	---	---	---	---	---
矛	---	---	---	---	---
---	---	---	---	---	---
					
大名（武士班促销）		先决条件	泰坦之魂	生命值	80
剑	重甲	护手	头盔	重型鞋类	药水
弓	---	---	---	---	---
矛	---	---	---	---	---
---	---	---	---	---	---
					
狂战士		先决条件	商人LV. 53	生命值	50
锤	重甲	护手	重型鞋类	盾	草药
斧头	---	---	---	披风	药水
枪	---	---	---	---	---
---	---	---	---	---	---
					
贵族（狂战士等级提升）		先决条件	泰坦之魂	生命值	100
锤	重甲	护手	重型鞋类	盾	草药
斧头	---	头盔	---	披风	药水
枪	---	---	---	---	---
---	---	---	---	---	---
					
法师		先决条件	---	生命值	20
职员	衣服	魔术师帽	轻便鞋类	拼写	戒指
弩	---	---	---	---	披风
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
大法师（法师职业晋升）		先决条件	泰坦之魂	生命值	40
职员	衣服	魔术师帽	轻便鞋类	拼写	戒指
弩	---	---	---	---	披风
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
牧师		先决条件	商人LV. 10	生命值	20
锤	衣服	魔术师帽	轻便鞋类	拼写	盾
矛	---	---	---	---	披风
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
主教（神职人员等级提升）		先决条件	泰坦之魂	生命值	40
锤	衣服	魔术师帽	轻便鞋类	拼写	盾
矛	---	---	---	---	戒指
棍棒	---	---	---	---	披风
---	---	---	---	---	---
					
德鲁伊		先决条件	商人LV. 22	生命值	20
职员	衣服	草药	草药	护身符	拼写
弓	---	---	---	---	---
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
大德鲁伊（德鲁伊职业晋升）		先决条件	泰坦之魂	生命值	40
职员	衣服	草药	草药	护身符	拼写
弓	---	---	---	戒指	---
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
巫师		先决条件	商人LV. 32	生命值	20
职员	衣服	手套	轻便鞋类	拼写	拼写
匕首	---	---	---	---	---
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
术士（巫师职业晋升）		先决条件	泰坦之魂	生命值	40
职员	衣服	手套	轻便鞋类	拼写	拼写
匕首	---	---	---	---	---
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
法术之刃		先决条件	商人LV. 46	生命值	23
剑	重甲	魔术师帽	重型鞋类	护身符	护身符
斧头	光之爱	头盔	轻便鞋类	戒指	戒指
职员	衣服	护手	---	药水	草药
弓	---	手套	---	拼写	盾
					
魔法骑士(Spellblade Class Promotion)		先决条件	泰坦之魂	生命值	45
剑	重甲	魔术师帽	重型鞋类	护身符	护身符
斧头	光之爱	头盔	轻便鞋类	戒指	戒指
职员	衣服	护手	---	药水	草药
弓	---	手套	---	拼写	盾
					
风水师		先决条件	商人LV. 53	生命值	25
职员	衣服	魔术师帽	手套	拼写	草药
锤	---	---	---	---	盾
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
星术师（风水师班推广）		先决条件	泰坦之魂	生命值	50
职员	衣服	魔术师帽	手套	拼写	草药
锤	---	---	---	---	盾
棍棒	---	---	---	---	---
---	---	---	---	---	---
					
贼		先决条件	---	生命值	22
匕首	轻甲	盗贼帽子	手套	护身符	戒指
弓	---	---	---	披风	---
弩	---	---	---	---	---
---	---	---	---	---	---
					
骗子（盗贼等级提升）		先决条件	泰坦之魂	生命值	45
匕首	轻甲	盗贼帽子	手套	护身符	戒指
弓	---	---	轻便鞋类	披风	---
弩	---	---	---	---	---
---	---	---	---	---	---
					
僧		先决条件	商人LV. 10	生命值	23
衣服	护身符	护身符	护身符	戒指	戒指
---	披风	---	---	---	---
---	---	---	---	---	---
---	---	---	---	---	---
					
棋圣（和尚班推广）		先决条件	泰坦之魂	生命值	45
衣服	护身符	护身符	护身符	戒指	戒指
---	披风	---	---	---	---
---	---	---	---	---	---
---	---	---	---	---	---
					
火枪手		先决条件	商人LV. 22	生命值	23
弩	轻甲	手套	重型鞋类	药水	护身符
剑	---	---	---	---	---
枪	---	---	---	---	---
---	---	---	---	---	---
					
征服者（火枪手班促销）		先决条件	泰坦之魂	生命值	45
弩	轻甲	手套	重型鞋类	药水	护身符
剑	---	---	轻便鞋类	---	---
枪	---	---	---	---	---
---	---	---	---	---	---
					
流浪者		先决条件	商人LV. 32	生命值	25
匕首	轻甲	盗贼帽子	轻便鞋类	草药	护身符
斧头	---	---	---	披风	---
枪	---	---	---	---	---
---	---	---	---	---	---
					
探路者（流浪者班促销）		先决条件	泰坦之魂	生命值	50
匕首	轻甲	盗贼帽子	轻便鞋类	草药	护身符
斧头	---	---	---	披风	---
枪	---	---	---	---	---
---	---	---	---	---	---
					
忍者		先决条件	商人LV. 46	生命值	30
匕首	轻甲	盗贼帽子	手套	轻便鞋类	戒指
剑	---	---	---	---	---
弓	---	---	---	---	---
---	---	---	---	---	---
					
老师（忍者班促销）		先决条件	泰坦之魂	生命值	60
匕首	轻甲	盗贼帽子	手套	轻便鞋类	戒指
剑	---	---	---	---	---
弓	---	---	---	---	---
---	---	---	---	---	---
					
舞蹈家		先决条件	商人LV. 53	生命值	35
匕首	轻甲	盗贼帽子	手套	轻便鞋类	戒指
弓	---	---	---	---	护身符
弩	---	---	---	---	---
棍棒	---	---	---	---	---
					
杂技演员（舞蹈班推广）		先决条件	泰坦之魂	生命值	70
匕首	轻甲	盗贼帽子	手套	轻便鞋类	戒指
弓	---	---	---	---	护身符
弩	---	---	---	---	---
棍棒	---	---	---	---	---

'''


t1=tt.splitlines()
i=0
h_d={}
all_mod_s=set()
for h in range(int(len(t1)/6)):

    t2= t1[i:i+6]
    i+=6
    f_t=[l.split('\t') for l in t2 ]
    f_t2=[l for a in f_t[1:-1] for l in a]
    t_s = set(f_t2)
    t_s.remove('---')
    all_mod_s=all_mod_s.union(t_s)

    h_d[f_t[0][0]]=t_s

all_mod_s=list(all_mod_s)
t_l=[]
for key in h_d:
    new_list=[]
    m=list(h_d[key])
    for i in range(len(all_mod_s)):
        b=all_mod_s[i]
        if all_mod_s[i] in m:
            new_list.append('T')

            m.remove(all_mod_s[i])
            # a=m.index(all_mod_s[i])
            #
            # m.remove(a)

        else:
            new_list.append('')

    if m:
        print(m)

    new_list1=[key]
    new_list1.extend(new_list)
    t_l.append(new_list1)

with open('1.txt',encoding='utf8',mode='w') as fn:
    fn.write('|'.join(all_mod_s))
    fn.write('\n')
    for l in t_l:
        fn.write('|'.join(l))
        fn.write('\n')


print(1)

